<HTML>
<BODY bgColor=#ffffff leftMargin=40 link=#500000 vLink=#505050>
<FONT FACE="Verdana, Arial, Helvetica" SIZE=2>
<FONT SIZE=4 COLOR=#500000>L'envers du d&#233;cor</FONT>
<P>Cet exemple utilise trois fichiers :</P>

</FONT>
<UL>
<FONT FACE="Verdana, Arial, Helvetica" SIZE=2>
    <LI>TLFish.htm contient le contr&#244;le Timeline et d'autres fonctions permettant de g&#233;rer 
    les objets sur la page. </LI>
    <LI>FishLeft.gif est un fichier GIF anim&#233; d'un poisson qui va vers la gauche. </LI>
    <LI>FishRght.gif est un fichier GIF anim&#233; d'un poisson qui va vers la droite. 
    </LI>

</FONT></UL>
<FONT FACE="Verdana, Arial, Helvetica" SIZE=2>
<P>Le contr&#244;le Timeline d&#233;clenche des &#233;v&#233;nements qui appellent des fonctions JavaScript 
permettant de contr&#244;ler le poisson et de modifier la position Z des algues. 
<P>Le code suivant est appel&#233; par le contr&#244;le Timeline lorsque 
le poisson est sur le point de se d&#233;placer vers la droite. Avant que le poisson commence &#224; nager, la position 
Z des algues est modifi&#233;e, l'image GIF anim&#233;e du poisson nageant vers la gauche 
(FishLeft.gif) est masqu&#233;e, l'image GIF anim&#233;e du poisson nageant vers la droite 
(FishRght.gif) devient visible. Ensuite, la fonction appelle la m&#233;thode d'ex&#233;cution du contr&#244;le 
Timeline pour lancer l'animation.</P>
<P><FONT face=Courier>function 
Swim_goRight()<BR>
{<BR>&nbsp;&nbsp; 
plant2.style.zIndex=-2 //Fait passer plant2 au second plan<BR>&nbsp;&nbsp; plant1.style.zIndex=1 //Fait passer plant1 au premier plan<BR>&nbsp;&nbsp; plant3.style.zIndex=1 //Fait passer plant3 au premier plan<BR>&nbsp;&nbsp; 
fishl.style.visibility=&quot;hidden&quot;<BR>&nbsp;&nbsp; 
fishr.style.visibility=&quot;visible&quot;<BR>&nbsp;&nbsp; 
Right.play()<BR>
}<BR>
</FONT>

<P>Le contr&#244;le Timeline appelle alors une autre fonction JavaScript 
qui d&#233;place le poisson de 5 pixels toutes les 100 ms :</P>
<P><FONT face=Courier>var moveInc = 
5<BR>
function Right_frameRight()<BR>
{<BR>&nbsp;&nbsp; fishr.style.left = 
fishr.style.pixelLeft + moveInc <BR>&nbsp;&nbsp; 
fishl.style.left = fishl.style.pixelLeft + moveInc <BR>
}<BR>
</FONT>

<P>Une fois que le poisson atteint le coin droit de l'&#233;cran, le contr&#244;le Timeline utilise des fonctions similaires pour ramener le poisson vers la gauche. 

</FONT></P>
</BODY>
</HTML>
