<HTML>
<HEAD>
</HEAD>
<BODY bgColor=#ffffff leftMargin=40 link=#500000 vLink=#505050>
<FONT FACE="Verdana, Arial, Helvetica" SIZE=2>
<FONT SIZE=4 COLOR=#500000>L'envers du d&#233;cor</FONT>
<BR><BR>
<P>Cet exemple utilise trois fichiers : UserNote.asp, DelNote.asp 
et SendNote.asp. </P>
<UL>
    <LI>UserNote.asp affiche les messages envoy&#233;s par d'autres membres de 
    l'organisation &#224; l'utilisateur connect&#233; &#224; cette page.
    <LI>DelNote.asp supprime des messages dans la liste des 
    messages stock&#233;s.
    <LI>SendNote.asp stocke les messages de l'utilisateur devant &#234;tre 
    envoy&#233;s &#224; d'autres utilisateurs de l'organisation. </LI></UL>

<P>UserNote.asp utilise un contr&#244;le Recordset et un contr&#244;le d&#233;pendant des donn&#233;es Grid
pour afficher des messages qui ont &#233;t&#233; envoy&#233;s &#224; l'utilisateur. </P>

<P>Les messages sont extraits de la table UserNote dans la base de donn&#233;es 
Gallery. Le jeu d'enregistrements interroge la table pour d'&#233;ventuels messages destin&#233;s 
&#224; l'utilisateur en cours. L'instruction SQL ci-dessous est utilis&#233;e &#224; cette fin : </P>

<FONT face=Courier>
function DTCRecordset1_onbeforeopen() { <BR>&nbsp;&nbsp; newSQL = &quot;Select * FROM UserNote WHERE 
(TO = '&quot; + Request.ServerVariables(&quot;AUTH_USER&quot;) + &quot;')&quot;; <BR>&nbsp;&nbsp; DTCRecordset1.setSQL(newSQL); <BR>
} 
</FONT>

<P>S'il n'y a aucun message pour l'utilisateur en cours, la grille 
n'appara&#238;t pas et il n'existe qu'un lien pour envoyer des messages. Si l'utilisateur 
a des messages, ceux-ci apparaissent dans la grille. La grille affiche le texte du 
message ainsi que son exp&#233;diteur. Une option permet aussi de supprimer 
chaque message. </P>

<P>DelNote.asp est appel&#233; lorsque l'utilisateur souhaite supprimer  
un message particulier. le num&#233;ro d'identification du message est transmis &#224; DelNote.asp et 
l'enregistrement correspondant est supprim&#233; dans la base de donn&#233;es. Une fois le message 
supprim&#233;, l'utilisateur est redirig&#233; vers la page UserNote.asp. </P>

<P>SendNote.asp utilise des contr&#244;les d&#233;pendant des donn&#233;es en combinaison  
avec le contr&#244;le FormManagervictlFormManagerControl pour enregistrer les donn&#233;es entr&#233;es par l'utilisateur 
dans la table UserNote. </P>

<P>Deux contr&#244;les acceptent l'entr&#233;e de donn&#233;es : le contr&#244;le 
textboxvictlTextBoxControl qui indique le destinataire du message et un 
contr&#244;le de zone de texte qui contient le message. </P>

<P>Lorsque vous adressez un message &#224; un autre membre de votre 
organisation, vous devez entrer &#224; la fois le domaine et le nom de l'utilisateur (par exemple, 
Domaine1\Utilisateur1). L'adresse ne tient pas compte des majuscules/minuscules. Dans cet exemple, le message 
est limit&#233; &#224; 255 caract&#232;res.</P></FONT>

</BODY>
</HTML>
