<HTML>
<HEAD>
</HEAD>
<BODY bgColor=#ffffff leftMargin=40 link=#500000 vLink=#505050>
<FONT FACE="Verdana, Arial, Helvetica" SIZE=2>
<FONT SIZE=4 COLOR=#500000>L'envers du d&#233;cor</FONT>
<BR><BR>
<P>Cet exemple utilise un fichier, Prefer.asp, qui cr&#233;e une feuille
HTML, laquelle renvoie les informations &#224; la m&#234;me page ASP. Lors de la cr&#233;ation d'une page 
pour enregistrer les param&#232;tres dans des cookies, vous n'utiliserez pas g&#233;n&#233;ralement cette m&#233;thode. Vous 
utiliserez plut&#244;t une page pour stocker les param&#232;tres et utiliserez d'autres pages dans 
votre application pour les relire. D'abord, cette page ASP v&#233;rifie si la feuille HTML 
a d&#233;j&#224; renvoy&#233; des informations &#224; la page ASP. Si c'est le cas, deux cookies sont &#233;crits 
&#224; l'aide de Visual Basic c&#244;t&#233; serveur, Scripting Edition (VBScript).</P>
<FONT face=Courier>
If Len(Request(&quot;BGColor&quot;)) &gt; 0 
then <BR>&nbsp;&nbsp; Response.Cookies(&quot;BGColor&quot;) 
= Request(&quot;BGColor&quot;) <BR>&nbsp;&nbsp; 
Response.Cookies(&quot;FGColor&quot;) = Request(&quot;FGColor&quot;) <BR>
End If 
</FONT>
<P>Ensuite, le code v&#233;rifie si un cookie nomm&#233; BGColor 
a &#233;t&#233; &#233;crit. En l'absence de cookie, la page n'enregistre aucune 
pr&#233;f&#233;rence et l'index des zones d&#233;roulantes indique 0. Si les 
cookies existent, ils sont enregistr&#233;s dans des variables qui doivent &#234;tre plac&#233;es dans 
JavaScript c&#244;t&#233; client.</P>
<FONT face=Courier>
If 
Request.Cookies(&quot;intBGColor&quot;) = &quot;&quot; then <BR>&nbsp;&nbsp; intBG = 0 <BR>&nbsp;&nbsp; intFG = 0 <BR>
Else <BR>&nbsp;&nbsp; intBG = 
Request.Cookies(&quot;intBGColor&quot;) <BR>&nbsp;&nbsp; 
intFG = Request.Cookies(&quot;intFGColor&quot;) <BR>
End If 
</FONT>
<P>La balise BODY permet de d&#233;finir la couleur de fond et d'appeler une 
fonction pour d&#233;finir les valeurs d'index des zones d&#233;roulantes.</P>
<FONT face=Courier>&lt;BODY BGCOLOR=&lt;%= 
Request.Cookies(&quot;BGColor&quot;)%&gt; ONLOAD=&quot;setcolor()&quot;&gt; 
</FONT>
<P>La fonction SetColor utilise JavaScript pour d&#233;finir les valeurs d'index. 
Le code obtient les valeurs &#224; partir des cookies lus &#224; l'aide de  
VBScript c&#244;t&#233; serveur. </P>
<FONT face=Courier>
function setcolor() { <BR>&nbsp;&nbsp; document.Pref.BGColor.selectedIndex = 
&lt;%=intBG%&gt;; <BR>&nbsp;&nbsp; 
document.Pref.FGColor.selectedIndex = &lt;%=intFG%&gt;; <BR>
} 
</FONT>
<P>La couleur de premier plan est d&#233;finie &#224; l'aide de la balise FONT.</P>
<FONT face=Courier>&lt;FONT 
COLOR=&lt;%=Request.Cookies(&quot;FGColor&quot;)%&gt;&gt; 
</FONT>
<P>Le reste de la page cr&#233;e une feuille qui, lorsqu'elle est envoy&#233;e, appelle une fonction pour &#233;crire les valeurs d'index des zones d&#233;roulantes 
dans les cookies et renvoyer les informations &#224; cette m&#234;me page
ASP.</P></FONT>

</BODY>
</html>
