/******************************************************************************
 *
 * dbdebug.h - デバッグ出力関数の宣言
 *
 * -- 著作権表示 --
 *
 *  Copyright(C) 1997 by ACCESS Co.,Ltd.
 *  All right reseved.
 *
 * -- 変更記録 --
 *
 *  $Log: /NetFront/TCP/dm_sdk/dmcast/dbdebug.h $
 * 
 * 1     98/10/26 14:53 Ueda
 * make branch dream-cast SDK
 * 
 * 1     98/08/19 18:33 Kawaguti
 *
 *****************************************************************************/
#ifdef __cplusplus /* Support for C++ */
extern "C" {
#endif /* __cplusplus */

#if !defined(DBDEBUG_H)
#define DBDEBUG_H

/*
 * デバッグ出力可否フラグ
 *
 * デバッグ出力を行う場合に1とする。行わない場合は,0。
 */
extern int dbDebug;

/* トレースを表示する */
#define DB_DEBUG_TRACE (0x00000001)

/* TCPのデバッグメッセージを表示する */
#define DB_DEBUG_TCP (0x00000002)

/* PPPのデバッグメッセージを表示する */
#define DB_DEBUG_PPP        (0x00000004)
#define DB_DEBUG_PPP_PACKET (0x00000008)

/* DNSのデバッグメッセージを表示する */
#define DB_DEBUG_DNS (0x00000010)

/*
 * 外部公開する関数の定義セクション
 */

/******************************************************************************
 * dbInit - デバッグ出力の初期化
 *****************************************************************************/

extern void
dbInit(void);

/******************************************************************************
 * dbPrint - デバッグ表示
 *****************************************************************************/

extern void
dbPrint(int in_patt, char *in_format, ...);

/******************************************************************************
 * DB_TRACE - トレースマクロ
 *****************************************************************************/

#define DB_TRACE dbPrint(DB_DEBUG_TRACE, "DEBUG: %s(%d)\n",__FILE__,__LINE__)

#endif /* !defined(DEDEBUG_H) */
#ifdef __cplusplus

} /* End of extern "C" { */
#endif /* __cplusplus */
/*****************************************************************************/
/* Muleの設定(必ず各行が1行コメントでなければ認識されないので注意) */
/* Local Variables: */
/* mode: c */
/* tab-width: 4 */
/*****************************************************************************/
