<html>
<head>
<meta NAME="GENERATOR" Content="Microsoft Developer Studio">
<title>Data Entry - Behind the Scenes</title>

</head>
<BODY BGCOLOR="#FFFFFF" LEFTMARGIN="40" LINK="#500000" VLINK="#505050">
<FONT FACE="Verdana, Arial, Helvetica" SIZE="2">
<FONT SIZE=4 COLOR=#500000>L'envers du d&#233;cor</FONT>
<BR><BR>
<P>Cet exemple utilise un seul fichier : Entry.asp. Ce fichier utilise 
plusieurs contr&#244;les DTC diff&#233;rents pour parcourir et &#233;diter les enregistrements  
de la base de donn&#233;es et y naviguer.</P>
<P><STRONG>Recordset DTC</STRONG> : Ce contr&#244;le connecte 
la page &#224; la table DENTRY.</P>
<P><STRONG>TextboxDTC</STRONG> : Ces contr&#244;les permettent d'afficher 
et d'&#233;diter les champs Pr&#233;nom, Nom, Adresse, Ville, Pays/Province et 
Code postal de la table DENTRY. Chacun de ces contr&#244;les est li&#233; &#224; un 
champ de la table.</P>
<P><STRONG>OptionGroup DTC</STRONG> : Ce contr&#244;le est li&#233; au champ 
SEXE de la table DENTRY. Les valeurs statiques de Masculin et F&#233;minin sont 
d&#233;finies dans les propri&#233;t&#233;s du contr&#244;le. Elles correspondent &#224; 1 pour Masculin et &#224; 0 pour 
F&#233;minin dans la table.</P>
<P><STRONG>Listbox DTC</STRONG>: Ce contr&#244;le est d&#233;fini comme zone de liste 
d&#233;roulante et est li&#233; au champ REVENUS de la table DENTRY.</P>
<P><STRONG>Checkbox DTC</STRONG> : Ce contr&#244;le est li&#233; au champ 
PC de la table DENTRY. La valeur du champ est une valeur binaire qui 
d&#233;termine si la case &#224; cocher doit &#234;tre activ&#233;e ou pas.</P>
<P><STRONG>RecordsetNavBar DTC</STRONG> : Ce contr&#244;le est li&#233; au contr&#244;le 
DTC Recordset pour permettre &#224; l'utilisateur d'ex&#233;cuter pas &#224; pas les enregistrements de la 
table DENTRY.</P>
<P><STRONG>FormManager DTC</STRONG> : Ce contr&#244;le g&#232;re le formulaire tout entier. 
Lorsque le formulaire est affich&#233; la premi&#232;re fois, il est en mode Navigation. Deux 
boutons visibles en haut du formulaire permettent d'alterner entre les modes 
Navigation et &#233;dition. Lorsque vous passez en mode &#233;dition, trois nouveaux boutons 
deviennent visibles et le contr&#244;le RecordsetNavBar est masqu&#233;. Les trois boutons suppl&#233;mentaires 
permettent d'Ins&#233;rer, Supprimer ou Actualiser des informations dans la table DENTRY.<BR>Dans la bo&#238;te  
de dialogue Propri&#233;t&#233;s de FormManager, les propri&#233;t&#233;s des modes Navigation et &#233;dition sont d&#233;finies de fa&#231;on &#224; 
permettre d'activer et de d&#233;sactiver les contr&#244;les du formulaire. Le mode Navigation est &#233;galement d&#233;fini pour &#234;tre le
mode par d&#233;faut quand vous acc&#233;dez &#224; cette page Web.<BR>Les propri&#233;t&#233;s des boutons sont d&#233;finies dans l'onglet Action de la bo&#238;te de dialogue 
Propri&#233;t&#233;s de FormManager. Chaque 
bouton ex&#233;cute un ensemble diff&#233;rent d'actions.</P>
<P>Le bouton &#233;diter permet d'activer les contr&#244;les du formulaire, 
d'afficher trois boutons pour Ins&#233;rer, Supprimer et Actualiser. Il permet aussi de masquer 
le contr&#244;le RecordsetNavBar.</P>
<P>Le bouton Ins&#233;rer permet d'appeler la m&#233;thode Recordset.AddRecord 
puis la m&#233;thode Recordset.MoveLast afin de vous permettre d'&#233;diter l'enregistrement 
nouvellement ajout&#233;.</P>
<P>Le bouton Supprimer permet d'appeler la m&#233;thode Recordset.DeleteRecord 
afin de supprimer l'enregistrement s&#233;lectionn&#233; puis d'appeler la m&#233;thode 
Recordset.MoveFirst pour afficher le premier enregistrement du jeu d'enregistrements.</P>
<P>Le bouton Actualiser appelle la m&#233;thode Recordset.UpdateRecord afin d'enregistrer les
modifications apport&#233;es &#224; l'enregistrement s&#233;lectionn&#233;. 
Il faut cliquer sur ce bouton pour enregistrer les modifications 
apport&#233;es &#224; un enregistrement cr&#233;&#233; &#224; l'aide du bouton Ins&#233;rer.</P>
<P>Le bouton Navigation permet de d&#233;sactiver les contr&#244;les du formulaire, de masquer les trois boutons d'&#233;dition et d'afficher le contr&#244;le RecordsetNavBar.</P>

</FONT>
</BODY>
</html>
