<html>
<BODY bgColor=#ffffff leftMargin=40 link=#500000 vLink=#505050>
<FONT FACE="Verdana, Arial, Helvetica" SIZE=2>
<FONT SIZE=4 COLOR=#500000>L'envers du d&#233;cor</FONT></FONT>
<FONT FACE="Verdana, Arial, Helvetica" SIZE=2>
<P>Cet exemple utilise trois fichiers :</P></FONT>
<UL>
<FONT FACE="Verdana, Arial, Helvetica" SIZE=2>
    <LI>RandomAd.asp affiche la publicit&#233; s&#233;lectionn&#233;e de fa&#231;on al&#233;atoire.
    <LI>RandomAd.txt d&#233;termine les publicit&#233;s &#224; utiliser.
    <LI>AdRedir.asp redirige l'utilisateur une fois qu'il a choisi une publicit&#233;.</FONT></LI></UL>
<FONT FACE="Verdana, Arial, Helvetica" SIZE=2>
<P>RandomAd.asp n'utilise que deux lignes de script pour afficher 
la publicit&#233;. La premi&#232;re ligne cr&#233;e la r&#233;f&#233;rence de l'objet au composant AdRotator 
et la seconde ligne obtient des informations du fichier RandomAd.txt pour afficher 
la publicit&#233; :
<P>&lt;%Set ad = 
Server.CreateObject(&quot;MSWC.AdRotator&quot;)%&gt;<BR>&lt;%= ad.GetAdvertisement(&quot;RandomAd.txt&quot;) %&gt;</P>  

<P>RandomAd.txt sert de fichier de programmation de la rotation. Ce fichier 
contient des informations que le composant de rotation des publicit&#233;s 
utilise pour g&#233;rer et afficher les images des diff&#233;rentes publicit&#233;s. Il vous permet 
de sp&#233;cifier les d&#233;tails des publicit&#233;s, comme la taille de l'espace publicitaire, 
les fichiers image &#224; utiliser et le pourcentage de temps pendant lequel chaque fichier doit &#234;tre affich&#233;.
<P>Le fichier de programmation de la rotation poss&#232;de deux sections : * la premi&#232;re section 
d&#233;finit les param&#232;tres qui s'appliquent &#224; toutes les images des publicit&#233;s figurant dans le programme de 
rotation. * La deuxi&#232;me section donne des informations sur les fichiers et l'emplacement de chaque publicit&#233; ainsi que le poids en termes de temps d'affichage qui doit &#234;tre allou&#233; &#224; chaque publicit&#233;. 
Le poids correspond &#224; un nombre compris entre 0 et 4 294 967 295 qui 
indique le poids relatif de la publicit&#233;. 
<P>Si, par exemple, un fichier de programmation de la rotation contient trois publicit&#233;s 
avec des poids d&#233;finis &#224; 2, 3 et 5, la premi&#232;re publicit&#233; est affich&#233;e 20 
pour cent du temps, la seconde 30 pour cent du temps et la troisi&#232;me 50 pour cent 
du temps.
<P>Une ligne contenant uniquement un ast&#233;risque s&#233;pare les deux  
sections (*). Ci-dessous une partie du fichier RandomAd.txt qui contient une  
entr&#233;e pour une publicit&#233; :
<P>
<FONT face=Courier>REDIRECT 
AdRedir.asp<BR>
WIDTH 468<BR>
HEIGHT 
60<BR>
BORDER 1<BR>
*<BR>
../images/rollover.gif<BR>
http://www.microsoft.com/frontpage<BR>
Free Beta Copy 
of Microsoft FrontPage 98<BR>
2 <BR></P>
</FONT>
<P>AdRedir.asp redirige les utilisateurs vers l'URL appropri&#233;e 
une fois qu'ils ont cliqu&#233; sur la publicit&#233;.
<P> 
<FONT face=Courier>&lt;%<BR> If 
Request.QueryString(&quot;url&quot;) &lt;&gt; &quot;&quot; Then <BR>&nbsp;&nbsp; Response.Redirect(Request.QueryString(&quot;url&quot;))<BR> 
End If <BR>%&gt; 
</FONT></P>
<P>Peut aussi inclure un script dans le fichier de redirection pour compter 
le nombre d'utilisateurs ayant cliqu&#233; sur une publicit&#233; particuli&#232;re et enregistrer ces informations dans un fichier sur le serveur.</FONT></P></FONT>
</BODY>
</html>
